Revit 2026 API
ExternalDefinition Class
 The ExternalDefinition object adds properties specific to Autodesk Revit shared parameter definitions.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Definition
 Autodesk.Revit.DB.ExternalDefinition
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class ExternalDefinition : Definition,
	IDisposable
Public Class ExternalDefinition
	Inherits Definition
	Implements IDisposable
public ref class ExternalDefinition : public Definition,
	IDisposable
type ExternalDefinition =
    class
        inherit Definition
        interface IDisposable
    end
The ExternalDefinition type exposes the following members.
Properties
Name | Description
Description |  The description of the parameter. The description will be used as tooltip in the Revit UI including in the properties palette.
GUID | Returns the GUID associated with the shared parameter definition.
HideWhenNoValue |  Indicates whether this parameter should be hidden from the properties palette when it has no value.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name | The user visible name for the parameter.
(Overrides Definition.Name)
OwnerGroup |  Returns or change the group ID of the external parameter definition.
UserModifiable |  Indicates whether the parameter can be modified by the user interface.
Visible | Indicates if the parameter is visible in the Autodesk Revit user interface.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ExternalDefinition
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetDataType |  Gets a ForgeTypeId identifying the data type describing values of the parameter.
(Inherited from Definition)
GetGroupTypeId |  Returns the identifier of the parameter definition's parameter group.
(Overrides Definition.GetGroupTypeId())
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
The ExternalDefinition object can be created by a definition Group object from a shared parameters file. External parameter definition must belong to a Group which is nothing more than a collection of shared parameter definitions. The following process should be followed to add a parameter to an element: Open the shared parameters file, via the Application.OpenSharedParameterFile() method. Access an existing or create a new group, via the DefinitionFile.Groups property. Access an existing or create a new external parameter definition, via the DefinitionGroup.Definitions property. Create a new Binding object with the categories to which the parameter will be bound using an InstanceBinding or a TypeBinding object. Finally add the binding and definition to the document using the Document.ParameterBindings object.
Shared parameters added to elements are typically visible to interactive users. To add data to elements that is never visible to interactive users, use Extensible Storage to construct and populate the needed structured data.
See Also
Reference
Autodesk.Revit.DB Namespace